# SpringCloud

### 1장. 스프링, 클라우드와 만나다.

##### 1.1 마이크로서비스란
1. 모놀리식 아키텍처에서 애플리케이션은 배포가능한 단일 소프트웨어 산출물로 전달, UI, 비즈니스 로직, 데이터베이 엑세스 로직이 모두 하나의 애플리케이션 산출물로 패키징 및 배포됨
2. 대형 모놀리식 애플리케이션을 확장하려고 할 떄, 기술 및 조직적으로 생기는 난제를 해결하기 위해 **마이크로서비스**가 등장했다.
3. 마이크로서비스는 애플리케이션을 제한된 책임을 담당하는 컴포넌트로 분해하며, 코드베이스를 명확히 정의한 작은 조각으로 분리하여 관리한다.
4. 마이크로서비스의 특징
  - 애플리케이션 로직을 각자 책임이 명확한 작은 컴퍼넌트로들로 분해하고 이들을 조합하여 솔루션을 제공
  - 각 컴포넌트는 작은 책임영역을 담당하고, 완전히 상호 독립적으로 배포된다(비즈니스 영역의 한 부분에서만 책임을 담당)
  - 재사용이 가능해야 한다.
  - 몇가지 기본 원칙에 기반을 두며, 서비스 제공자 사이의 데이터 교환을 위해 HTTP와 JSON같은 경량 통신 프로토콜을 사용
  - 애플리케이션은 기술중립적 프로토콜을 사용해 통신하므로 서비스 구현 기술과는 무관, 즉 다양한 언어와 기술로 구축할 수 있음
  - 작고 독립적이며 분산된 마이크로 서비스를 사용해 조직은 명확히 정의된 책임 영역을 담당하는 소규모 팀을 보유할 수 있음. 하나의 목표를 가지지만, 자기가 개발한 서비스만 책임진다.
